app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test1"], ["LIMIT", 1]]
---
  def create
    # byebug
    @user = User.find_by(username: user_login_params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    token = request.headers['Authorization']
    user = User.find_by(id: token)