app/controllers/celebs_controller.rb

SELECT "celebs".* FROM "celebs"
---
    def index
        puts "hit get_celeb"
        puts params
        celebs = Celeb.all