app/controllers/favorite_celebs_controller.rb

    def show
        @favorite_celebs = FavoriteCeleb.select{|record| record.user_id = params[:user_id]}
---
SELECT "favorite_celebs".* FROM "favorite_celebs"

    def destroy
        @favorite_celebs = FavoriteCeleb.select{|record| record.user_id = params[:user_id]}
        @favorite_celebs.destroy()
---
SELECT "favorite_celebs".* FROM "favorite_celebs"
DELETE FROM "favorite_celebs" WHERE "favorite_celebs"."id" = $1  [["id", 1]]