app/controllers/users_controller.rb

    def create
        # puts "reached create on backend"
        # byebug
        # @user = User.create(user_params)
        @user = User.create(name: params[:name], username: params[:username], password: params[:password])
---
INSERT INTO "users" ("username", "password_digest", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"